using System;
//Создайте свою пользовательскую сборку по примеру сборки CarLibrary из урока, сборка будет использоваться для работы с конвертером температуры
namespace Lesson33HomeWork33_Task2
{
    public class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
