using System;
using System.Collections.Generic;
//Представьте, что вы пишите приложение для Автостанции и вам необходимо создать простую 
//коллекцию автомобилей со следующими данными: марка автомобиля, модель, год выпуска, цвет. А 
//также вторую коллекцию с моделью автомобиля, именем покупателя и его номером телефона. 
//Используя простейший LINQ запрос, выведите на экран информацию о покупателе одного из 
//автомобилей и полную характеристику приобретенной им модели
namespace Lesson26HomeWork26_Task2
{
    public class  Program
    {
        static void Main(string[] args)
        {

        }
    }
}
