using System;
//Создайте класс и примените к его методам атрибут Obsolete сначала в форме, просто 
//выводящей предупреждение, а затем в форме, препятствующей компиляции. 
//Продемонстрируйте работу атрибута на примере вызова данных методов.
namespace Lesson34HomeWork34_Task2
{
    public class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
