using System;
//Создайте программу-рефлектор, которая позволит получить информацию о сборке и входящих 
//в ее состав типах. Для основы можно использовать программу-рефлектор из урока
namespace Lesson33HomeWork33_Task1
{
    public class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
