using System;
//Создайте одномерный массив строковых элементов на 10 элементов. Заполните массив различными словами. Создайте метод, 
//    принимающий массив строковых элементов, выполняющий внутри последовательную конкатенацию всех элементов массива и 
//    возвращающий результат этой конкатенации. Выведите результат на экран.
namespace Lesson9HomeWork9_DopTask3
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
