using System;
//Создайте двумерный массив вещественных элементов. Заполните его элементами и выведите на экран все элементы массива.
namespace Lesson9HomeWork9_DopTask2
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
