using System;
//Создайте программу, в которой предоставьте пользователю доступ к сборке из Задания 2. 
//Реализуйте использование метода конвертации значения температуры из шкалы Цельсия в 
//шкалу Фаренгейта. Выполняя задание используйте только рефлексию.
namespace Lesson33HomeWork33_Task3
{
    public class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
