using System;
//Создайте одномерный массив целочисленных значений на 10 элементов. Заполните массив значениями в цикле. Создайте метод, 
//принимающий массив целочисленных элементов и одно целое число. Данный метод должен увеличивать каждый элемент массива на
//значение полученного в качестве аргумента целого числа и возвращать новый полученный массив. Создайте метод, принимающий 
//массив целочисленных элементов и выводящий на экран все имеющиеся элементы массива.
//Выведите на экран массив после увеличения значений его элементов.
namespace Lesson9HomeWork9_DopTask4
{
    public class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
